public enum Місяці {

    СІЧЕНЬ(31, Сезони.ЗИМА),
        ЛЮТИЙ(28, Сезони.ЗИМА),
        БEPEЗЕНЬ(31, Сезони.ВЕСНА),
        КВІТЕНЬ(30, Сезони.ВЕСНА),
        ТРАВЕНЬ(31, Сезони.ВЕСНА),
        ЧЕРВЕНЬ(30, Сезони.ЛІТО),
        ЛИПЕНЬ(31, Сезони.ЛІТО),
        СЕРПЕНЬ(31, Сезони.ЛІТО),
        ВЕРЕСЕНЬ(30, Сезони.ОСІНЬ),
        ЖОВТЕНЬ(31, Сезони.ОСІНЬ),
        ЛИСТОПАД(30, Сезони.ОСІНЬ),
        ГРУДЕНЬ(31, Сезони.ЗИМА);

        private final int дні;
        private final Сезони сезон;

        Місяці(int дні, Сезони сезон) {
            this.дні = дні;
            this.сезон = сезон;
        }

        public int getДні() {
            return дні;
        }

        public Сезони getСезон() {
            return сезон;
        }
    }

